{
  "categories": {
    "training": {
      "topics": {
        "introduction_to_strides": {
          "description": "Strides are short, fast running efforts that improve speed, efficiency, and neuromuscular activation without causing fatigue.",
          "examples": [
            "Strides are not sprints; they should be relaxed and at 3K to 5K effort.",
            "Each stride lasts about 20 seconds or 100 meters to prevent anaerobic fatigue.",
            "Strides help activate fast-twitch muscle fibers that are not used during easy runs."
          ]
        },
        "benefits_of_strides": {
          "description": "Strides enhance running efficiency, prevent injuries, and prepare the body for harder workouts.",
          "examples": [
            "Strides improve speed without requiring hard interval training.",
            "They reduce injury risk by strengthening muscle fibers and neuromuscular pathways.",
            "Regular strides prepare the body for high-intensity workouts and races."
          ]
        },
        "how_to_perform_strides": {
          "description": "Steps to properly execute strides to maximize their benefits.",
          "examples": [
            "Start at an easy jogging pace and gradually accelerate to 3K to 5K effort.",
            "Focus on relaxed, quick turnover with minimal tension in the arms and shoulders.",
            "Gradually decelerate at the end and transition back to an easy jog."
          ]
        },
        "when_to_do_strides": {
          "description": "Different ways to incorporate strides into training for optimal performance.",
          "examples": [
            "Perform strides as part of a warm-up before workouts or races.",
            "Include strides randomly during easy runs to improve efficiency.",
            "Use strides at the end of long runs to activate fast-twitch fibers when fatigued."
          ]
        },
        "strides_and_long_term_training": {
          "description": "The cumulative benefits of regularly including strides in training.",
          "examples": [
            "Doing strides consistently over weeks and months builds lasting speed and efficiency.",
            "Regular strides improve race performance from 5K to ultramarathon distances.",
            "Strides create a foundation that supports interval workouts and race-specific training."
          ]
        }
      }
    }
  }
}
